trial3/app/controllers/profiles_controller.rb

SELECT "users".* FROM "users" WHERE "users"."profile_name" = 'davidongchoco' LIMIT 1
---
  def show
  	@user = User.find_by_profile_name(params[:id])